Revit 2024 API
BuiltInFailures.StairRampFailures.StairsPathPositionResetWarning Property
 The stairs path doesn't intersect with riser lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsPathPositionResetWarning { get; }
Visual Basic
Public Shared ReadOnly Property StairsPathPositionResetWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsPathPositionResetWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace